app/controllers/casein/inboxes_controller.rb

    def index
      @casein_page_title = 'Inboxes'
      @inboxes = Inbox.order(sort_order(:shortmessage)).paginate page: params[:page]
---
SELECT  "inboxes".* FROM "inboxes" ORDER BY "inboxes"."shortmessage" ASC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "inboxes"

    def show
      @casein_page_title = 'View inbox'
      @inbox = Inbox.find params[:id]
      @inbox.read = 0
      @inbox.save
---
SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "inboxes" SET "read" = $1, "updated_at" = $2 WHERE "inboxes"."id" = $3  [["read", "f"], ["updated_at", "2017-05-20 14:25:18.641815"], ["id", 1]]

    def new
      @url = Link.find(params[:url]).display_slug
---
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def create
      @inbox = Inbox.new inbox_params
      @inbox.sender = current_user.id

      if @inbox.save
---
INSERT INTO "inboxes" ("shortmessage", "sender", "reseiver", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["shortmessage", "http://localhost:3000/z2oo"], ["sender", 2], ["reseiver", 1], ["created_at", "2017-05-19 14:13:37.338224"], ["updated_at", "2017-05-19 14:13:37.338224"]]

    def update
      @casein_page_title = 'Update inbox'

      @inbox = Inbox.find params[:id]
---
SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]