app/controllers/casein/links_controller.rb

SELECT  "links".* FROM "links" ORDER BY "links"."given_url" DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "links"
---
    def index
      @casein_page_title = 'Links'
      @links = Link.order(sort_order(:given_url)).paginate page: params[:page]

SELECT  "links".* FROM "links" WHERE "links"."slug" = $1 LIMIT $2  [["slug", "dfdf"], ["LIMIT", 1]]
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    if params[:slug]
      @link = Link.find_by(slug: params[:slug])
      if redirect_to @link.given_url
        @link.save
      end
    else
      @link = Link.find(params[:id])

DELETE FROM "links" WHERE "links"."id" = $1  [["id", 4]]
SELECT "links".* FROM "links"
---
    def new
      @casein_page_title = 'NEW Short'
      @link = Link.new
      Link.all.each {|i| i.destroy if Time.now.to_i - i.created_at.to_i >= 1296000 }

INSERT INTO "links" ("given_url", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["given_url", ""], ["slug", ""], ["created_at", "2017-05-18 14:03:45.156416"], ["updated_at", "2017-05-18 14:03:45.156416"]]
---
    def create
      @link = Link.new link_params
      @link.casein_admin_users_id = current_user.id
      if @link.save

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def update
      @casein_page_title = 'Update link'

      @link = Link.find params[:id]