app/views/casein/inboxes/_form.html.erb

SELECT "casein_admin_users".* FROM "casein_admin_users" ORDER BY "casein_admin_users"."name" ASC
---
  <div class="col-lg-6">
     <%= casein_select f, f.object, :reseiver, Casein::AdminUser.order(:name).collect {|c| [c.name, c.id]}, {:include_blank => '-- None --', :casein_label => "Choose an existing reseiver"} %>