app/views/casein/inboxes/_table.html.erb

SELECT  "links".* FROM "links" WHERE "links"."slug" = $1 LIMIT $2  [["slug", "pl98"], ["LIMIT", 1]]
SELECT  "casein_admin_users".* FROM "casein_admin_users" WHERE "casein_admin_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <td><%= casein_table_cell_link truncate(Link.find_by_slug(shortmessage).title, length: 30), casein_inbox_path(inbox) %></td>
      <td><%= casein_table_cell_link Casein::AdminUser.find(sender).name, casein_inbox_path(inbox) %></td>