app/views/casein/links/_table.html.erb

SELECT  "casein_admin_users".* FROM "casein_admin_users" WHERE "casein_admin_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <tr>
    <% userid = Casein::AdminUser.find(current_user.id) %>