app/controllers/redirect_url_controller.rb

	  def index
      @links = Link.new
    	if params[:slug]
      		@link = Link.find_by(slug: params[:slug])
---
SELECT  "links".* FROM "links" WHERE "links"."slug" = $1 LIMIT $2  [["slug", "130s"], ["LIMIT", 1]]